{
  "projects": [
    {
      "id": "codebuster",
      "title": "CodeBuster",
      "description": "An AI-powered code plagiarism detector that identifies similarities beyond simple token matching, providing a more effective alternative to traditional detection software.",
      "longDescription": "Developer on a 6-person team building CodeBuster, an advanced AI code plagiarism detector. The system uses TF-IDF features, GraphCodeBERT-based embeddings, and output-based similarity analysis to capture syntactic, semantic, and behavioral signals in code submissions.",
      "technologies": ["Python", "PyTorch", "scikit-learn", "Streamlit"],
      "github": "https://github.com/ArjunKrishnatry",
      "demo": null,
      "challenges": "Trained an MLP to fuse token, semantic, and output scores into an overall plagiarism-risk prediction. Achieved 50% higher detection rate for plagiarized code and 37% decrease in mean absolute error through hyperparameter tuning. Project to be presented at the Canadian Undergraduate Conference on AI 2025."
    },
    {
      "id": "easyaccounting",
      "title": "EasyAccounting",
      "description": "A cross-platform desktop application for personal financial tracking with custom expense categorization and visual dashboards.",
      "longDescription": "Built a full-stack desktop application using React for the frontend and FastAPI for the backend, packaged via Electron for cross-platform compatibility. Features include user authentication, local encryption, custom expense categories, and summary dashboards.",
      "technologies": ["React", "Electron", "FastAPI", "Python"],
      "github": "https://github.com/ArjunKrishnatry",
      "demo": null,
      "challenges": "Implemented secure local encryption for sensitive financial data. Currently used monthly by family members with plans for wider release including CI security checks (dependency scanning, static analysis) for stronger cybersecurity."
    },
    {
      "id": "rust-to-glory",
      "title": "Rust to Glory",
      "description": "A Java/Swing educational game developed as a team project, featuring custom UI panels, character animations, and an inventory system.",
      "longDescription": "Collaborated with a 4-person team to deliver an educational game for CS2212. Designed custom UI panels, character animations, and an item inventory subsystem. The project received a grade of 97%.",
      "technologies": ["Java", "Swing", "GitLab", "JUnit"],
      "github": "https://github.com/ArjunKrishnatry",
      "demo": null,
      "challenges": "Wrote extensive JUnit tests and refactored the MVC structure for maintainability. Used GitLab issues and merge requests for disciplined collaboration, resulting in an efficient goal-oriented team environment."
    },
    {
      "id": "ml-internship",
      "title": "Container Stacking Optimization",
      "description": "Deep Q-Network agent for optimizing container stacking at ports, developed during my ML internship at Solverminds Solutions.",
      "longDescription": "Built a Deep Q-Network (DQN) agent and custom environment for container stacking optimization. Incorporated lashing constraints to improve layout feasibility and reduce costs for shipping clients by automating stacking protocols.",
      "technologies": ["Python", "TensorFlow", "scikit-learn", "pandas"],
      "github": null,
      "demo": null,
      "challenges": "Researched supervised models (XGBoost, KAN) on hydrostatic datasets, achieving 0.09% Mean Absolute Percentage Error. Designed reward shaping and scenario simulators aligned with international port operations. Also mentored incoming interns, helping them join the team ahead of schedule."
    }
  ]
}
